{
  "connection_reset_by_peer": "The connection has been reset by Google Sheets API. Please retry.",
  "request_timeout": "The request has timeout on Google Sheets API side. Please retry.",
  "spreadsheet_error": "Uh-oh, seems like I encountered an issue with the %1 access to the %2 spreadsheet. Please contact an admin.",
  "no_tournament": "This server does not have any tournament running. Consider using the `%0create_tournament $tosurnament/guild_owner/create_tournament/parameter`.",
  "no_bracket": "This bracket does not exists. Check existing brackets using the `%0get_bracket` command.",
  "no_spreadsheet": "This tournament does not have any %1 spreadsheet set. Please contact an admin.",
  "invalid_worksheet": "The worksheet %1 does not exist. Please contact an admin.",
  "opponent_not_found": "Sorry %1, it seems I cannot find your opponent in the guild. Your action has been cancelled. Please contact your opponent (if you can't find them, contact an admin).\n\n__For the opponent, please check:__\n- If your account is not linked, did your discord tag change (check the numbers too) ? If it changed, you can try contacting an admin or using the `;link` command.\n- If your account is linked, it means you changed your osu name, please use `;name_change`.",
  "duplicate_team": "Uh-oh, it seems like the team **%1** is present multiples times on the players spreadsheet. Please contact an admin.",
  "team_not_found": "Team `%1` not found. Please contact an admin.",
  "duplicate_match_id": "There are multiple matches with this ID. Please contact an admin.",
  "match_id_not_found": "Match `%1` not found.",
  "date_is_not_string": "The `%1` range contains data that are not plain text.",
  "duplicate_player": "Uh-oh, it seems like the player **%1** is present multiple times on the players spreadsheet. Please contact an admin.",
  "invalid_date_or_format": "It seems a date on the schedules spreadsheet is invalid or the date_format set is wrongly formatted. Please contact an admin.",
  "already_player": "You are already a player.",
  "not_a_player": "Either you are not a player, you didn't use the `%0name_change` command or the players spreadsheet is not set. If it is not one the first two, please contact an admin.",
  "invalid_match_id_or_no_bracket_role": "Invalid match id or missing required bracket role.",
  "invalid_match_id": "Invalid match id.",
  "no_challonge": "No challonge has been set for the bracket `%1`.",
  "challonge_no_rights": "You don't have write access to the challonge.",
  "challonge_not_found": "Challonge not found.",  
  "invalid_mp_link": "Invalid mp link.",
  "participant_not_found": "The match %1 could not be updated in the challonge. Please, make sure that the participant names in the challonge are correct.",
  "match_not_found": "Match not found, there seems to be an error on the challonge.",
  "spreadsheet_rights": "Uh-oh, it seems like I don't have the %1 rights on the %3 spreadsheet of the bracket %2."
}
