{
  "connection_reset_by_peer": "Kết nối đã bị đặt lại bởi API của Google Trang tính. Hãy thử lại.",
  "request_timeout": "Yêu cầu bị quá thời gian ở phía API của Google Trang tính. Hãy thử lại.",
  "spreadsheet_error": "Ôi không, có vẻ như tôi gặp phải vấn đề về truy cập %1 tới %2 trang tính. Hãy liên hệ quản trị viên.",
  "no_tournament": "Máy chủ này không có giải đấu nào đang diễn ra. Cân nhắc sử dụng lệnh `%0create_tournament`.",
  "no_bracket": "Bảng đấu này không tồn tại. Kiểm tra các bảng đấu hiện có bằng lệnh `%0get_bracket`.",
  "no_spreadsheet": "Giải đấu này chưa có %1 trang tính nào được thiết lập. Hãy liên hệ quản trị viên.",
  "invalid_worksheet": "Bảng tính %1 không tồn tại. Hãy liên hệ quản trị viên.",
  "opponent_not_found": "Xin lỗi %1, có vẻ như tôi không thể tìm thấy đối thủ của bạn trong máy chủ. Hành động của bạn đã bị huỷ. Vui lòng liên lạc với đối thủ của bạn (nếu bạn không thể tìm họ, hãy liên hệ quản trị viên).\n\n__Dành cho đối thủ của bạn, hãy kiểm tra:__\n- Nếu tài khoản của bạn chưa được liên kết, liệu bạn vừa đổi thẻ tên Discord (kiểm tra cả số nhận diện nữa)? Nếu bạn đổi, vui lòng liên hệ quản trị viên hoặc dùng lệnh `;link`.\n- Nếu bạn đã liên kết tài khoản, có nghĩa là bạn đã thay đổi tên tài khoản osu!, hãy gõ `;name_change`.",
  "duplicate_team": "Ôi không, có vẻ như đội **%1** xuất hiện nhiều lần trên Trang tính Người chơi. Vui lòng liên hệ quản trị viên.",
  "team_not_found": "Không tìm thấy đội `%1`. Vui lòng liên hệ quản trị viên.",
  "duplicate_match_id": "Có nhiều trận đấu có cùng ID này. Vui lòng liên hệ quản trị viên.",
  "match_id_not_found": "Không tìm thấy trận `%1`.",
  "date_is_not_string": "Vùng `%1` chứa dữ liệu không phải văn bản thuần tuý.",
  "duplicate_player": "Ôi không, có vẻ như người chơi **%1** xuất hiện nhiều lần trên Trang tính Người chơi. Vui lòng liên hệ quản trị viên.",
  "invalid_date_or_format": "Có vẻ như ngày trên Trang tính Lịch trình không hợp lệ hoặc được định dạng sai cách. Vui lòng liên hệ quản trị viên.",
  "already_player": "Bạn đã là một người chơi.",
  "not_a_player": "Tôi không thể tìm bạn có phải là một người chơi, lý do có thể là:\n- Bạn đã liên kết tài khoản osu! với bot nhưng chưa thực hiện lệnh `%0name_change`\n- Thẻ tên Discord của bạn đã thay đổi (kiểm tra cả số định danh nữa), với trường hợp này, bạn hãy thử liên kết tài khoản của bạn với lệnh `%0link`\n",
  "invalid_match_id_or_no_bracket_role": "ID trận không hợp lệ hoặc thiếu vai trò bảng đấu được yêu cầu.",
  "invalid_match_id": "ID trận không hợp lệ.",
  "no_challonge": "Không có challonge được thiết lập cho bảng đấu `%1`.",
  "challonge_no_rights": "Bạn không có quyền viết vào challonge.",
  "challonge_not_found": "Không tìm thấy challonge.",
  "invalid_mp_link": "Đường dẫn mp không hợp lệ.",
  "participant_not_found": "Không thể cập nhật trận %1 trên challonge. Hãy đảm bảo tên của những người tham gia trên challonge đã chính xác.",
  "match_not_found": "Không tìm thấy trận, có vẻ như có lỗi gì đó trên challonge.",
  "spreadsheet_rights": "Ôi không, hình như tôi không có quyền %1 trên trang tính %2 của một bảng đấu."
}
